import codecs

rus1 = {'А': 'A',
        'В': 'B',
        'Е': 'E',
        'З': '3',
        'К': 'K',
        'М': 'M',
        'Н': 'H',
        'О': 'O',
        'Р': 'P',
        'С': 'C',
        'Т': 'T',
        'Х': 'X',
        'а': 'a',
        'е': 'e',
        'о': 'o',
        'р': 'p',
        'с': 'c',
        'у': 'y',
        'х': 'x',
        'п': 'n'}

rus2 = {'Б': '80',
        'Г': '81',
        'Д': '82',
        'И': '84',
        'Я': '85',
        'Ж': '86',
        'У': '87',
        'Ч': '88',
        'Ц': '89',
        'Ш': '8A',
        'Ё': '8B',
        'ж': '91',
        'Ы': '92',
        'Э': '93',
        'ц': '94',
        'Й': '96',
        'ю': '98',
        'Щ': '99',
        'Ю': '9A',
        'Ф': '9B',
        'Л': '9C',
        'П': '9F',
        'б': 'A0',
        'щ': 'A1',
        'и': 'A2',
        'в': 'A4',
        'э': 'A5',
        'ы': 'A6',
        'д': 'A7',
        'й': 'A8',
        'к': 'A9',
        'л': 'AA',
        'ё': 'AB',
        'т': 'AE',
        'ш': 'B1',
        'ч': 'B2',
        'ъ': 'B3',
        'м': 'B4',
        'г': 'B6',
        'я': 'B8',
        'ф': 'B9',
        'ь': 'BA',
        'н': 'BB',
        'з': 'BC'}
        
def convert(s: str):
    binstr = b''
    for c in s:
        if c in rus1.keys():
            binstr += rus1[c].encode(encoding='utf-8')
        elif c in rus2.keys():
            binstr += b'\xC3' + codecs.decode(rus2[c], 'hex')
        else: 
            binstr += c.encode(encoding='utf-8')
    return binstr.decode('utf-8')


#print(convert('Аа, Бб, Вв, Гг, Дд, Ее, Ёё, Жж, Зз, Ии, Йй, Кк, Лл, Мм, Нн, Оо, Пп, Рр, Сс, Тт, Уу, Фф, Хх, Цц, Чч, Шш, Щщ, Ъъ, Ыы, Ьь, Ээ, Юю, Яя.'))






    
    
